### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [4]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
#Check if there is missing data
purchase_data.count()
#There is no missing data so move on

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

## Player Count

* Display the total number of players

In [6]:
#list names of columns as they appear in the background for possible differences
list(purchase_data)
#names of columns appear as they do in the intial summary table above

['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price']

In [7]:
#Count the number of Unique Players 
unique_player_count = purchase_data['SN'].nunique()

#Display number of unique players
unique_player_count

576

In [8]:
#Now that we know what our count is...Lets display it more clearly

#Make a dict for the Total Unique Players
unique_player_dict = [{"Total Players": (unique_player_count)}]

#Convert unique_player_dict into a data frame
total_players_df = pd.DataFrame(unique_player_dict)

#Display the number_of_players_df
total_players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [9]:
#Display the overview of the data
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [10]:

#Count unique items using len for the Item ID
unique_items = len(purchase_data['Item ID'].unique())

#Get the average price using mean of the Price category 
avg_price= purchase_data['Price'].mean()

#Count the number of purchases
total_purchases= len(purchase_data['Purchase ID'])

#Calculate the total revenue from all sales
total_revenue= sum(purchase_data['Price'])

#create dataframe to hold above results
summary_df = pd.DataFrame({
    'Unique Items': unique_items,
    'Average Price': '${:.2f}'.format(avg_price),
    'Total Purchases': total_purchases,
    'Total Revenue': '${:.2f}'.format(total_revenue)
},index=[0])
summary_df

   Unique Items Average Price  Total Purchases Total Revenue
0           179         $3.05              780      $2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [11]:
#Display intial data summary 
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [22]:
# Calculations can also be performed on Series and added into DataFrames as new columns
gender_breakdown = purchase_data["Gender"].value_counts()

gender_breakdown_df = pd.DataFrame(gender_breakdown)

#count each gender
gender = purchase_data.drop_duplicates('SN')
gender_count = gender['Gender'].value_counts()

# Convert the column name into "Total Count"
gender_breakdown_df= gender_breakdown_df.rename(columns={"Gender": "Gender Count"})

gender_breakdown_df.head()

                       Gender Count
Male                            652
Female                          113
Other / Non-Disclosed            15

In [13]:
#Calculate the percentage of players by gender using our gender count and total players that we have already identified
percentage_of_players = gender_breakdown_df["Gender Count"]/total_players_df["Total Players"].sum() * 100

#Create a new summary column to show percentage_of_players
gender_breakdown_df["Percentage of Players"] = percentage_of_players

gender_breakdown_df

                       Gender Count  Percentage of Players
Male                            652             113.194444
Female                          113              19.618056
Other / Non-Disclosed            15               2.604167

In [14]:
#Reformat the "percentage of players" columns to include two decimals and add a % to the values
gender_breakdown_df["Percentage of Players"] = gender_breakdown_df["Percentage of Players"].map('{:,.2f}%'.format)

#Display new data frame
gender_breakdown_df.head()

                       Gender Count Percentage of Players
Male                            652               113.19%
Female                          113                19.62%
Other / Non-Disclosed            15                 2.60%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [15]:
#Display summary of data
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [16]:
#Calculate the purchase count for each gender
gender_purchase_data = purchase_data.groupby('Gender')
gender_purchase_count = gender_purchase_data['Gender'].count()

gender_purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [17]:
#Calculate the average purchase pirce
gender_purchase_mean = gender_purchase_data['Price'].mean()
gender_purchase_mean

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [18]:
#Calculte the Total Revenue
gender_purchase_total = gender_purchase_data['Price'].sum()
gender_purchase_total

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [23]:
#Create a DataFrame to display a summary table
gender_purchase_data_df = pd.DataFrame({
    'Number of Players': gender_count,
    'Purchase Count': gender_purchase_count,
    'Avg Purchase Price': gender_purchase_mean.map('${:,.2f}'.format),
    'Total Revenue': gender_purchase_total.map('${:,.2f}'.format),
})
gender_purchase_data_df

,Number of Players,Purchase Count,Avg Purchase Price,Total Revenue
Female,81,113,$3.20,$361.94
Male,484,652,$3.02,"$1,967.64"
Other / Non-Disclosed,11,15,$3.35,$50.19

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [24]:
#Create bins you want the age groups to be 
age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 400]

groups = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [28]:
#Assign the player base to the age groups
purchase_data['age_group'] =  pd.cut(purchase_data['Age'], age_bins, labels=groups)

In [29]:
#Group the player base by their age groupings, making sure to account for unique only
players_age_group = purchase_data.groupby('age_group').SN.nunique()

#create dataframe to show total count and percentage of total players for each group
age_demographics = pd.DataFrame({
    'Total Count': players_age_group,
    'Percentage of Players': (players_age_group / purchase_data.SN.nunique() * 100).map("{:.2f}".format)
})
age_demographics

           Total Count Percentage of Players
age_group
<10                 17                  2.95
10-14               22                  3.82
15-19              107                 18.58
20-24              258                 44.79
25-29               77                 13.37
30-34               52                  9.03
35-39               31                  5.38
40+                 12                  2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [33]:
#Seperate the columns we want to use for the analysis
purchase_count_age = purchase_data[['age_group', 'Purchase ID']]
purchase_values_age = purchase_data[['age_group', 'Price']]

#totals purchase by age bin
total_purchase_age = purchase_count_age.groupby('age_group').count() 

#Dollar values of purchase by age
total_purchase_values_age = purchase_values_age.groupby('age_group').sum()

In [ ]:
#display summary df
purchasing_age_analysis = pd.DataFrame({
    'Purchase Count': total_purchase_age['Purchase ID'],
    'Average Purchase Price': (total_purchase_values_age['Price'] / total_purchase_age['Purchase ID']).map("${:.2f}".format),
    'Total Purchase Value': total_purchase_values_age['Price'].map("${:.2f}".format)
})
purchasing_age_analysis

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [43]:
#Calculate purchases made by unique spenders
purchase_count = purchase_data["SN"].value_counts()

purchase_count

Lisosia93         5
Idastidru52       4
Iral74            4
Ilarin91          3
Iskadarya95       3
                 ..
Frichaststa61     1
Sondistanya61     1
Frichirranya75    1
Assirra56         1
Aeri84            1
Name: SN, Length: 576, dtype: int64

In [44]:
#Calculate the average purchase price
average_purchase_price = purchase_data["Price"].groupby(purchase_data["SN"]).mean()

#Calculate the revenue
total_purchase_value = purchase_data["Price"].groupby(purchase_data["SN"]).sum()

In [48]:
#Create the summary data frame 
top_spenders = pd.DataFrame({
    "Purchase Count":purchase_count,
    "Average Purchase Price":average_purchase_price,
    "Total Purchase Value":total_purchase_value
})

top_spenders

               Purchase Count  Average Purchase Price  Total Purchase Value
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [51]:
#Format our summary data frame top_spenders
top_spenders_final = top_spenders.sort_values("Total Purchase Value", ascending= False) 

top_spenders_final["Average Purchase Price"] = top_spenders_final["Average Purchase Price"].map("${:.2f}".format)

top_spenders_final["Total Purchase Value"] = top_spenders_final["Total Purchase Value"].map("${:.2f}".format)

In [55]:
#Print the Final Summary Table with the top 5 spenders
top_spenders_final[:5]

             Purchase Count Average Purchase Price Total Purchase Value
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [57]:
#Seperate the columns that we are going to use
popular_items = purchase_data[['Item ID', 'Item Name', 'Price']]
popular_items.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [58]:
#Calculate the count of the count of items purchased
purchase_count = popular_items.groupby(["Item ID","Item Name"])["Price"].count()

#Calculate the average price of the items
item_price= popular_items.groupby(["Item ID","Item Name"])["Price"].mean()

#Calculate the Total Purchase Value
popular_purchase_value = popular_items.groupby(["Item ID","Item Name"])["Price"].sum()

In [60]:
#Create an original summary table 
most_popular_items = pd.DataFrame({
    "Purchase Count":purchase_count,
    "Item Price":item_price,
    "Total Purchase Value":popular_purchase_value
})
most_popular_items.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4      1.2800                  5.12
1       Crucifer                         4      2.9425                 11.77
2       Verdict                          6      2.4800                 14.88
3       Phantomlight                     6      2.4900                 14.94
4       Bloodlord's Fetish               5      1.7000                  8.50

In [73]:
#Format the summary table with decending order from the top Purchase Count
popular_items_final = most_popular_items.sort_values("Purchase Count", ascending= False)

popular_items_final["Item Price"]= popular_items_final["Item Price"].map("${:.2f}".format)

popular_items_final["Total Purchase Value"]= popular_items_final["Total Purchase Value"].map("${:.2f}".format)

#Display the Final Data Table
popular_items_final[:5]

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [74]:
#Format the summary table from popular items with decending order from the top Total Purchase Value
profitable_items = most_popular_items.sort_values("Total Purchase Value", ascending= False)

profitable_items["Item Price"]= profitable_items["Item Price"].map("${:.2f}".format)

profitable_items["Total Purchase Value"]= profitable_items["Total Purchase Value"].map("${:.2f}".format)

#Display the Final Data Table
profitable_items[:5]

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80